Revit 2020 API
UnitUtils.GetValidDisplayUnits Method
 Gets all valid display units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static IList<DisplayUnitType> GetValidDisplayUnits()
Visual Basic
Public Shared Function GetValidDisplayUnits As IList(Of DisplayUnitType)
Visual C++
public:
static IList<DisplayUnitType>^ GetValidDisplayUnits()
Return Value
 The valid display units.
Remarks
 A display unit is considered valid if it is an actual unit like meters or feet. Obsolete values and the special values DUT_CUSTOM and DUT_UNDEFINED are not considered valid.
See Also
UnitUtils Class
GetValidDisplayUnits Overload
Autodesk.Revit.DB Namespace